timetracker/DataProcessors/ОбработкаКнопкиТаймер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаКнопкиТаймер</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяСтарта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

timetracker/Documents/РегистрацияВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РегистрацияВремени</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИспользованоВремени</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотраченоВремени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

timetracker/DataProcessors/ОбработкаКнопкиТаймер/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗасечьВремя(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Задача) Тогда
		ПоказатьПредупреждение(, "Выберите задачу!");
		Возврат;
	КонецЕсли;
	
	// Запоминаем время старта в реквизите обработки (Объект.ВремяСтарта)
	Объект.ВремяСтарта = ТекущаяДата();
	
	
	Сообщить("⏱ Время по задаче """ + Объект.Задача + """ засечено с " + Формат(Объект.ВремяСтарта, "ДФ=чч:мм:сс"));

КонецПроцедуры

&НаСервере
Функция СоздатьДокументПоВремени(Секунд, ВремяСтарта)
	
	Док = Документы.РегистрацияВремени.СоздатьДокумент();
	Док.Задача = Объект.Задача;
	Док.Дата = ТекущаяДата();
	Док.ВремяНачала = ВремяСтарта;
	Док.ВремяОкончания = ТекущаяДата();
	Док.ПотраченоВремени = Секунд;
	Док.Комментарий = "Засечено через таймер";
	Док.Записать(РежимЗаписиДокумента.Проведение);
		
	Возврат Док.Ссылка;
	
КонецФункции

&НаКлиенте
Процедура Остановить(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Задача) Тогда
		ПоказатьПредупреждение(, "Выберите задачу!");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ВремяСтарта) Тогда
		ПоказатьПредупреждение(, "Сначала засеките время!");
		Возврат;
	КонецЕсли;
	
	// Считаем разницу
	ТекущееВремя = ТекущаяДата();
	РазницаСекунд = ТекущееВремя - Объект.ВремяСтарта;
	
	// Вызываем серверную функцию
	СоздатьДокументПоВремени(РазницаСекунд, Объект.ВремяСтарта);
	
	// Обнуляем засечку, чтобы не мешала
	Объект.ВремяСтарта = Дата(1,1,1);
		
	Сообщить("✅ Документ создан. Время: " + РазницаСекунд + " сек.");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьТаймер(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВремяСтарта) Тогда
	     Сообщить ("Таймер не был запущен!")
	 Иначе
		  Объект.ВремяСтарта = неопределено;
		 Сообщить("❌ Таймер отменен!") 
		
	КонецЕсли;
	
	
КонецПроцедуры
